app/views/authors/show.html.erb

<ul>
  <% if @author.posts.any? %>
    <h2>Posts by <%= @author.name %></h2>
    <% @author.posts.each do |post| %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."author_id" = ?  [["author_id", 1]]
SELECT 1 AS one FROM "posts" WHERE "posts"."author_id" = ? LIMIT ?  [["author_id", 3], ["LIMIT", 1]]