app/views/posts/_form.html.erb

  <div>
    <% if @post.author_id.present? %>
---
SELECT "authors".* FROM "authors"