app/controllers/authors_controller.rb

INSERT INTO "authors" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "dew"], ["email", "eiei"], ["created_at", "2023-09-19 05:26:55.861964"], ["updated_at", "2023-09-19 05:26:55.861964"]]
---
  def create
    @author = Author.new(author_params)

    respond_to do |format|
      if @author.save

UPDATE "authors" SET "name" = ?, "updated_at" = ? WHERE "authors"."id" = ?  [["name", "jamer"], ["updated_at", "2023-09-19 06:46:24.070020"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @author.update(author_params)

SELECT "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "authors" WHERE "authors"."id" = ?  [["id", 8]]
---
def destroy
  author = Author.find(params[:id])
  author.destroy